-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Май 11 2026 г., 05:38
-- Версия сервера: 10.4.32-MariaDB
-- Версия PHP: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `forum`
--

-- --------------------------------------------------------

--
-- Структура таблицы `blocked_users`
--

CREATE TABLE `blocked_users` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `blocked_by_id` int(11) NOT NULL,
  `reason` text DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `expires_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `blocked_users`
--

INSERT INTO `blocked_users` (`id`, `user_id`, `blocked_by_id`, `reason`, `created_at`, `expires_at`) VALUES
(8, 11, 2, 'бан от админа / модера', '2026-05-10 06:07:16', NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `description` text DEFAULT NULL,
  `parent_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `name`, `description`, `parent_id`) VALUES
(10, 'Honkai Star Rail', 'Родительская категория по хср', NULL),
(11, 'Genshin Impact', 'Родительская по геншину', NULL),
(12, 'Zenless Zone Zero', 'Родительская по ззз', NULL),
(14, 'Обсуждение игры', 'хср', 10),
(15, 'Вопросы новичков', 'хср', 10),
(16, 'Новости', 'хср', 10),
(17, 'Обновления', 'хср', 10),
(18, 'Мемы / Скрины', 'хср', 10),
(19, 'Обсуждение игры', 'геншин', 11),
(20, 'Новости', 'геншин', 11),
(21, 'Обновления', 'геншин', 11),
(22, 'Мемы / Скрины', 'геншин', 11),
(23, 'Обсуждение игры', 'ззз', 12),
(24, 'Новости', 'ззз', 12),
(25, 'Обновления', 'ззз', 12),
(26, 'Мемы / Скрины', 'ззз', 12),
(27, 'Оффтопик', 'Разговорная', NULL),
(28, 'Творчество', 'Для всех', NULL),
(29, 'Забавные баги', 'Я не придумал еще одну чтобы красиво было', NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `complaints`
--

CREATE TABLE `complaints` (
  `id` int(11) NOT NULL,
  `post_id` int(11) DEFAULT NULL,
  `topic_id` int(11) DEFAULT NULL,
  `user_id` int(11) NOT NULL,
  `status` enum('pending','reviewed','dismissed') DEFAULT 'pending',
  `created_at` datetime DEFAULT current_timestamp(),
  `reason_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `complaints`
--

INSERT INTO `complaints` (`id`, `post_id`, `topic_id`, `user_id`, `status`, `created_at`, `reason_id`) VALUES
(22, NULL, 4, 2, 'pending', '2026-05-07 12:24:39', 1),
(23, NULL, 7, 2, 'pending', '2026-05-07 12:24:42', 5),
(25, 196, NULL, 2, 'pending', '2026-05-07 12:24:55', 3),
(26, 11, NULL, 2, 'pending', '2026-05-07 12:24:59', 7);

-- --------------------------------------------------------

--
-- Структура таблицы `contacts`
--

CREATE TABLE `contacts` (
  `id` int(11) NOT NULL,
  `name` varchar(45) DEFAULT NULL,
  `email` varchar(200) DEFAULT NULL,
  `theme` varchar(45) DEFAULT NULL,
  `message` text DEFAULT NULL,
  `moder_id` int(11) DEFAULT NULL,
  `status` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `contacts`
--

INSERT INTO `contacts` (`id`, `name`, `email`, `theme`, `message`, `moder_id`, `status`) VALUES
(1, 'ASD', 'sad@gmail.com', 'Asd', 'asd', NULL, 'pending');

-- --------------------------------------------------------

--
-- Структура таблицы `events`
--

CREATE TABLE `events` (
  `id` int(11) NOT NULL,
  `name` varchar(45) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `datee` date DEFAULT NULL,
  `id_u` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `events`
--

INSERT INTO `events` (`id`, `name`, `description`, `datee`, `id_u`) VALUES
(1, 'Веб ивент', 'Веб ивент с подарками', '2026-04-09', 2),
(2, 'Ноый патч', 'Игровое обновление', '2026-04-22', 2),
(3, 'Годовщина', 'Годовщина игры ', '2026-04-26', 2);

-- --------------------------------------------------------

--
-- Структура таблицы `likes`
--

CREATE TABLE `likes` (
  `id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `likes`
--

INSERT INTO `likes` (`id`, `post_id`, `user_id`, `created_at`) VALUES
(6, 153, 10, '2026-05-03 07:51:42'),
(10, 196, 10, '2026-05-11 08:55:57'),
(11, 11, 10, '2026-05-11 08:55:58'),
(12, 12, 10, '2026-05-11 08:55:59'),
(13, 233, 10, '2026-05-11 09:09:39');

-- --------------------------------------------------------

--
-- Структура таблицы `notifications`
--

CREATE TABLE `notifications` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `type` enum('new_reply','mention','complaint_result','like') NOT NULL,
  `entity_id` int(11) DEFAULT NULL,
  `message` text DEFAULT NULL,
  `is_read` tinyint(1) DEFAULT 0,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `posts`
--

CREATE TABLE `posts` (
  `id` int(11) NOT NULL,
  `topic_id` int(11) NOT NULL,
  `author_id` int(11) NOT NULL,
  `parent_post_id` int(11) DEFAULT NULL,
  `content` text NOT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `is_deleted` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `posts`
--

INSERT INTO `posts` (`id`, `topic_id`, `author_id`, `parent_post_id`, `content`, `created_at`, `updated_at`, `is_deleted`) VALUES
(11, 4, 2, NULL, 'Я думаю Арчерон сейчас вообще топ меты, но требует руки', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(12, 4, 2, NULL, 'Баннер спорный, но персонаж сильный', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(13, 5, 2, NULL, 'Дан Хэн с правильной сборкой просто уничтожает всё', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(14, 5, 2, NULL, 'Лучше всего работает через скорость и криты', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(15, 6, 2, NULL, 'Виртуальная вселенная стала сложнее, но интереснее', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(16, 6, 2, NULL, 'Боссов можно проходить через щиты и контроль', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(17, 7, 2, NULL, 'Тир-лист постоянно меняется, это нормально', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(18, 7, 2, NULL, 'S-ранг сейчас слишком перегружен персонажами', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(19, 8, 2, NULL, '4★ герои всё ещё актуальны, особенно саппорты', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(20, 8, 2, NULL, 'Некоторые 4★ сильнее старых 5★', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(21, 9, 2, NULL, 'Фарм реликвий — это отдельная боль', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(22, 9, 2, NULL, 'Рандом иногда просто уничтожает билды', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(23, 10, 2, NULL, 'Эндгейм сейчас ощущается пустоватым', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(24, 10, 2, NULL, 'Ждём новые режимы', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(25, 14, 2, NULL, 'Арлекино реально сильная, но рискованная', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(26, 14, 2, NULL, 'Если есть сигна — стоит крутить', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(27, 15, 2, NULL, 'Фурина раскрывается только в правильных пачках', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(28, 15, 2, NULL, 'Гидро саппорт топ уровня', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(29, 16, 2, NULL, 'Артефакты — это казино внутри казино', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(30, 16, 2, NULL, 'Можно фармить неделю и ничего не получить', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(31, 17, 2, NULL, 'Кач аккаунта быстрее всего через квесты и ивенты', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(32, 17, 2, NULL, 'Ресурсы не стоит тратить на всё подряд', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(33, 18, 2, NULL, 'Сумеру — один из самых красивых регионов', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(34, 18, 2, NULL, 'Инадзума тоже сильно атмосферная', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(35, 19, 2, NULL, 'Скарамучча до сих пор один из самых удобных ДД', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(36, 19, 2, NULL, 'Его мобильность решает', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(37, 20, 2, NULL, '5★ персонажи не всегда сильнее 4★', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(38, 20, 2, NULL, 'Баланс странный, но интересный', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(39, 21, 2, NULL, 'Донат ускоряет прогресс, но не обязателен', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(40, 21, 2, NULL, 'Ф2П вполне играбельно', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(41, 22, 2, NULL, '12 этаж бездны — это проверка билдов', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(42, 22, 2, NULL, 'Главное — правильные реакции', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(43, 23, 2, NULL, 'Лор Тейвата становится всё сложнее', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(44, 23, 2, NULL, 'Похоже, всё связано сильнее чем кажется', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(45, 24, 2, NULL, 'Агенты S-ранга сейчас явно доминируют', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(46, 24, 2, NULL, 'Баланс ещё будут править', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(47, 25, 2, NULL, 'Hollow требует хорошего тайминга', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(48, 25, 2, NULL, 'Ошибки сильно наказываются', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(49, 26, 2, NULL, 'Команды в ZZZ очень зависят от синергии', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(50, 26, 2, NULL, 'Без правильной связки сложно играть', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(51, 27, 2, NULL, 'Фарм ресурсов довольно быстрый, если знать маршруты', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(52, 27, 2, NULL, 'Но всё равно гринд ощущается', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(53, 28, 2, NULL, 'Стартовые агенты норм, но быстро заменяются', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(54, 28, 2, NULL, 'Лучше вкладываться в будущих S-рангов', '2026-05-01 19:23:57', '2026-05-01 19:23:57', 0),
(106, 26, 26, NULL, 'Не думаю что это актуально в текущем патче.', '2026-04-30 19:28:23', '2026-05-01 19:28:23', 0),
(107, 33, 26, NULL, 'Можно ли вообще это эффективно использовать?', '2026-04-10 19:28:23', '2026-05-01 19:28:23', 0),
(108, 33, 25, NULL, 'Мета сейчас сильно смещается, интересно наблюдать.', '2026-04-19 19:28:23', '2026-05-01 19:28:23', 0),
(109, 17, 15, NULL, 'Кто-нибудь пробовал этот билд на практике?', '2026-04-02 19:28:23', '2026-05-01 19:28:23', 0),
(110, 31, 21, NULL, 'Есть ли альтернативные варианты сборки?', '2026-04-23 19:28:23', '2026-05-01 19:28:23', 0),
(111, 14, 32, NULL, 'У меня другой опыт — делал иначе и получилось лучше.', '2026-04-28 19:28:23', '2026-05-01 19:28:23', 0),
(112, 33, 25, NULL, 'Мета сейчас сильно смещается, интересно наблюдать.', '2026-04-19 19:28:23', '2026-05-01 19:28:23', 0),
(113, 15, 30, NULL, 'Спасибо за гайд, помог разобраться.', '2026-04-14 19:28:23', '2026-05-01 19:28:23', 0),
(114, 11, 20, NULL, 'Согласен с автором темы, но есть нюансы.', '2026-04-29 19:28:23', '2026-05-01 19:28:23', 0),
(115, 13, 18, NULL, 'Можно ли вообще это эффективно использовать?', '2026-04-17 19:28:23', '2026-05-01 19:28:23', 0),
(116, 31, 31, NULL, 'Слишком переоценённый персонаж, имхо.', '2026-04-11 19:28:23', '2026-05-01 19:28:23', 0),
(117, 28, 26, NULL, 'Мета сейчас сильно смещается, интересно наблюдать.', '2026-04-28 19:28:23', '2026-05-01 19:28:23', 0),
(118, 32, 16, NULL, 'Не думаю что это актуально в текущем патче.', '2026-04-14 19:28:23', '2026-05-01 19:28:23', 0),
(119, 23, 33, NULL, 'Мета сейчас сильно смещается, интересно наблюдать.', '2026-04-26 19:28:23', '2026-05-01 19:28:23', 0),
(120, 17, 29, NULL, 'Мета сейчас сильно смещается, интересно наблюдать.', '2026-04-03 19:28:23', '2026-05-01 19:28:23', 0),
(121, 31, 24, NULL, 'Не думаю что это актуально в текущем патче.', '2026-04-25 19:28:23', '2026-05-01 19:28:23', 0),
(122, 29, 20, NULL, 'Есть ли альтернативные варианты сборки?', '2026-04-13 19:28:23', '2026-05-01 19:28:23', 0),
(123, 27, 25, NULL, 'Мета сейчас сильно смещается, интересно наблюдать.', '2026-04-28 19:28:23', '2026-05-01 19:28:23', 0),
(124, 32, 16, NULL, 'Можно ли вообще это эффективно использовать?', '2026-04-08 19:28:23', '2026-05-01 19:28:23', 0),
(125, 18, 17, NULL, 'Можно ли вообще это эффективно использовать?', '2026-05-01 19:28:23', '2026-05-01 19:28:23', 0),
(126, 19, 27, NULL, 'Можно ли вообще это эффективно использовать?', '2026-04-14 19:28:23', '2026-05-01 19:28:23', 0),
(127, 15, 15, NULL, 'Можно ли вообще это эффективно использовать?', '2026-04-25 19:28:23', '2026-05-01 19:28:23', 0),
(128, 19, 16, NULL, 'У меня другой опыт — делал иначе и получилось лучше.', '2026-04-03 19:28:23', '2026-05-01 19:28:23', 0),
(129, 18, 26, NULL, 'Можно ли вообще это эффективно использовать?', '2026-04-17 19:28:23', '2026-05-01 19:28:23', 0),
(130, 31, 33, NULL, 'У меня другой опыт — делал иначе и получилось лучше.', '2026-04-05 19:28:23', '2026-05-01 19:28:23', 0),
(131, 33, 13, NULL, 'Слишком переоценённый персонаж, имхо.', '2026-04-02 19:28:23', '2026-05-01 19:28:23', 0),
(132, 17, 19, NULL, 'У меня другой опыт — делал иначе и получилось лучше.', '2026-04-09 19:28:23', '2026-05-01 19:28:23', 0),
(133, 15, 26, NULL, 'Есть ли альтернативные варианты сборки?', '2026-04-04 19:28:23', '2026-05-01 19:28:23', 0),
(134, 17, 25, NULL, 'Кто-нибудь пробовал этот билд на практике?', '2026-04-08 19:28:23', '2026-05-01 19:28:23', 0),
(135, 32, 16, NULL, 'Можно ли вообще это эффективно использовать?', '2026-04-04 19:28:23', '2026-05-01 19:28:23', 0),
(137, 34, 33, NULL, 'Интересно увидеть больше таких обсуждений.', '2026-04-20 19:30:10', '2026-05-01 19:30:10', 0),
(138, 38, 24, NULL, 'Интересно увидеть больше таких обсуждений.', '2026-04-17 19:30:10', '2026-05-01 19:30:10', 0),
(139, 22, 14, NULL, 'Недооценённый вариант, стоит попробовать.', '2026-04-14 19:30:10', '2026-05-01 19:30:10', 0),
(140, 50, 10, NULL, 'Спасибо за разбор, полезно.', '2026-04-15 19:30:10', '2026-05-01 19:30:10', 0),
(141, 51, 24, NULL, 'Спасибо за разбор, полезно.', '2026-04-15 19:30:10', '2026-05-01 19:30:10', 0),
(142, 37, 10, NULL, 'Спасибо за разбор, полезно.', '2026-04-19 19:30:10', '2026-05-01 19:30:10', 0),
(143, 47, 13, NULL, 'Есть ощущение что мета снова поменялась.', '2026-04-15 19:30:10', '2026-05-01 19:30:10', 0),
(144, 62, 32, NULL, 'Согласен с автором, тема реально интересная.', '2026-04-17 19:30:10', '2026-05-01 19:30:10', 0),
(145, 49, 11, NULL, 'Можно ли это улучшить как-то?', '2026-04-29 19:30:10', '2026-05-01 19:30:10', 0),
(146, 33, 28, NULL, 'Не уверен что это сейчас актуально.', '2026-04-26 19:30:10', '2026-05-01 19:30:10', 0),
(147, 18, 22, NULL, 'Спасибо за разбор, полезно.', '2026-04-23 19:30:10', '2026-05-01 19:30:10', 0),
(148, 21, 19, NULL, 'Пробовал этот билд — работает неплохо.', '2026-04-17 19:30:10', '2026-05-01 19:30:10', 0),
(149, 13, 10, NULL, 'Есть ощущение что мета снова поменялась.', '2026-04-24 19:30:10', '2026-05-01 19:30:10', 0),
(150, 15, 24, NULL, 'Пробовал этот билд — работает неплохо.', '2026-04-15 19:30:10', '2026-05-01 19:30:10', 0),
(151, 46, 26, NULL, 'Недооценённый вариант, стоит попробовать.', '2026-04-12 19:30:10', '2026-05-01 19:30:10', 0),
(152, 57, 14, NULL, 'Интересно увидеть больше таких обсуждений.', '2026-04-26 19:30:10', '2026-05-01 19:30:10', 0),
(153, 7, 33, NULL, 'Согласен с автором, тема реально интересная.', '2026-04-29 19:30:10', '2026-05-01 19:30:10', 0),
(154, 12, 14, NULL, 'Можно ли это улучшить как-то?', '2026-04-16 19:30:10', '2026-05-01 19:30:10', 0),
(155, 29, 23, NULL, 'Можно ли это улучшить как-то?', '2026-04-23 19:30:10', '2026-05-01 19:30:10', 0),
(156, 28, 28, NULL, 'Недооценённый вариант, стоит попробовать.', '2026-04-30 19:30:10', '2026-05-01 19:30:10', 0),
(158, 61, 14, NULL, 'Спасибо за разбор, полезно.', '2026-04-23 19:30:10', '2026-05-01 19:30:10', 0),
(159, 48, 10, NULL, 'Интересно увидеть больше таких обсуждений.', '2026-04-20 19:30:10', '2026-05-01 19:30:10', 0),
(160, 23, 18, NULL, 'Кто-нибудь тестил на практике?', '2026-04-24 19:30:10', '2026-05-01 19:30:10', 0),
(161, 36, 15, NULL, 'Можно ли это улучшить как-то?', '2026-04-17 19:30:10', '2026-05-01 19:30:10', 0),
(162, 31, 33, NULL, 'Слишком переоценённый персонаж имхо.', '2026-04-30 19:30:10', '2026-05-01 19:30:10', 0),
(163, 20, 32, NULL, 'Кто-нибудь тестил на практике?', '2026-04-25 19:30:10', '2026-05-01 19:30:10', 0),
(164, 17, 22, NULL, 'Есть ощущение что мета снова поменялась.', '2026-04-20 19:30:10', '2026-05-01 19:30:10', 0),
(165, 24, 24, NULL, 'Недооценённый вариант, стоит попробовать.', '2026-04-26 19:30:10', '2026-05-01 19:30:10', 0),
(166, 45, 24, NULL, 'Слишком переоценённый персонаж имхо.', '2026-04-28 19:30:10', '2026-05-01 19:30:10', 0),
(167, 26, 17, NULL, 'Есть ощущение что мета снова поменялась.', '2026-04-26 19:30:10', '2026-05-01 19:30:10', 0),
(168, 6, 15, NULL, 'Слишком переоценённый персонаж имхо.', '2026-04-27 19:30:10', '2026-05-01 19:30:10', 0),
(169, 35, 19, NULL, 'Кто-нибудь тестил на практике?', '2026-04-14 19:30:10', '2026-05-01 19:30:10', 0),
(170, 9, 25, NULL, 'Недооценённый вариант, стоит попробовать.', '2026-04-21 19:30:10', '2026-05-01 19:30:10', 0),
(171, 30, 19, NULL, 'Не уверен что это сейчас актуально.', '2026-04-17 19:30:10', '2026-05-01 19:30:10', 0),
(172, 56, 25, NULL, 'Недооценённый вариант, стоит попробовать.', '2026-04-29 19:30:10', '2026-05-01 19:30:10', 0),
(173, 25, 33, NULL, 'Пробовал этот билд — работает неплохо.', '2026-05-01 19:30:10', '2026-05-01 19:30:10', 0),
(174, 27, 10, NULL, 'Кто-нибудь тестил на практике?', '2026-04-24 19:30:10', '2026-05-01 19:30:10', 0),
(175, 5, 29, NULL, 'Не уверен что это сейчас актуально.', '2026-04-30 19:30:10', '2026-05-01 19:30:10', 0),
(176, 60, 31, NULL, 'Недооценённый вариант, стоит попробовать.', '2026-04-16 19:30:10', '2026-05-01 19:30:10', 0),
(177, 63, 31, NULL, 'Слишком переоценённый персонаж имхо.', '2026-04-27 19:30:10', '2026-05-01 19:30:10', 0),
(178, 32, 30, NULL, 'Кто-нибудь тестил на практике?', '2026-04-17 19:30:10', '2026-05-01 19:30:10', 0),
(179, 10, 23, NULL, 'Можно ли это улучшить как-то?', '2026-04-18 19:30:10', '2026-05-01 19:30:10', 0),
(180, 8, 30, NULL, 'Есть ощущение что мета снова поменялась.', '2026-04-19 19:30:10', '2026-05-01 19:30:10', 0),
(181, 55, 15, NULL, 'Есть ощущение что мета снова поменялась.', '2026-04-23 19:30:10', '2026-05-01 19:30:10', 0),
(182, 19, 15, NULL, 'Согласен с автором, тема реально интересная.', '2026-04-17 19:30:10', '2026-05-01 19:30:10', 0),
(183, 14, 19, NULL, 'Недооценённый вариант, стоит попробовать.', '2026-04-26 19:30:10', '2026-05-01 19:30:10', 0),
(184, 44, 12, NULL, 'Не уверен что это сейчас актуально.', '2026-04-26 19:30:10', '2026-05-01 19:30:10', 0),
(185, 43, 18, NULL, 'Кто-нибудь тестил на практике?', '2026-04-27 19:30:10', '2026-05-01 19:30:10', 0),
(186, 11, 28, NULL, 'Недооценённый вариант, стоит попробовать.', '2026-04-14 19:30:10', '2026-05-01 19:30:10', 0),
(187, 54, 22, NULL, 'Есть ощущение что мета снова поменялась.', '2026-04-18 19:30:10', '2026-05-01 19:30:10', 0),
(188, 39, 32, NULL, 'Есть ощущение что мета снова поменялась.', '2026-04-21 19:30:10', '2026-05-01 19:30:10', 0),
(189, 41, 22, NULL, 'Есть ощущение что мета снова поменялась.', '2026-04-22 19:30:10', '2026-05-01 19:30:10', 0),
(190, 59, 27, NULL, 'Пробовал этот билд — работает неплохо.', '2026-04-24 19:30:10', '2026-05-01 19:30:10', 0),
(191, 16, 27, NULL, 'Согласен с автором, тема реально интересная.', '2026-04-14 19:30:10', '2026-05-01 19:30:10', 0),
(192, 40, 18, NULL, 'Согласен с автором, тема реально интересная.', '2026-04-25 19:30:10', '2026-05-01 19:30:10', 0),
(193, 53, 16, NULL, 'Кто-нибудь тестил на практике?', '2026-04-24 19:30:10', '2026-05-01 19:30:10', 0),
(194, 42, 31, NULL, 'Слишком переоценённый персонаж имхо.', '2026-04-27 19:30:10', '2026-05-01 19:30:10', 0),
(195, 52, 17, NULL, 'Недооценённый вариант, стоит попробовать.', '2026-04-28 19:30:10', '2026-05-01 19:30:10', 0),
(196, 4, 23, NULL, 'Можно ли это улучшить как-то?', '2026-04-23 19:30:10', '2026-05-01 19:30:10', 0),
(212, 5, 2, NULL, 'Дан Хэн с правильной сборкой просто уничтожает всё', '2026-05-10 19:23:57', '2026-05-10 19:23:57', 0),
(223, 10, 20, NULL, 'Сообщение пользователя 20', '2026-05-04 10:07:29', '2026-05-10 10:07:29', 0),
(224, 15, 21, NULL, 'Сообщение пользователя 21', '2026-05-05 10:07:29', '2026-05-10 10:07:29', 0),
(225, 13, 22, NULL, 'Сообщение пользователя 22', '2026-05-05 10:07:29', '2026-05-10 10:07:29', 0),
(226, 12, 23, NULL, 'Сообщение пользователя 23', '2026-05-06 10:07:29', '2026-05-10 10:07:29', 0),
(227, 16, 24, NULL, 'Сообщение пользователя 24', '2026-05-06 10:07:29', '2026-05-10 10:07:29', 0),
(228, 15, 25, NULL, 'Сообщение пользователя 25', '2026-05-07 10:07:29', '2026-05-10 10:07:29', 0),
(229, 19, 26, NULL, 'Сообщение пользователя 26', '2026-05-08 10:07:29', '2026-05-10 10:07:29', 0),
(230, 13, 27, NULL, 'Сообщение пользователя 27', '2026-05-08 10:07:29', '2026-05-10 10:07:29', 0),
(231, 15, 28, NULL, 'Сообщение пользователя 28', '2026-05-09 10:07:29', '2026-05-10 10:07:29', 0),
(232, 17, 29, NULL, 'Сообщение пользователя 29', '2026-05-10 10:07:29', '2026-05-10 10:07:29', 0),
(233, 6, 10, NULL, 'asd', '2026-05-11 09:09:30', '2026-05-11 09:09:30', 0),
(234, 11, 10, NULL, 'dfg', '2026-05-11 09:12:34', '2026-05-11 09:12:34', 0),
(235, 4, 10, NULL, 'tcc', '2026-05-11 09:30:32', '2026-05-11 09:30:32', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `report_reasons`
--

CREATE TABLE `report_reasons` (
  `id` int(11) NOT NULL,
  `name` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `report_reasons`
--

INSERT INTO `report_reasons` (`id`, `name`) VALUES
(1, 'Спам'),
(2, 'Оскорбления'),
(3, 'Флуд'),
(4, 'Оффтоп'),
(5, 'Нецензурная лексика'),
(6, 'Ложная информация'),
(7, 'Реклама'),
(8, 'Дублирующий пост'),
(9, 'Нарушение правил форума'),
(10, 'Нежелательный контент'),
(11, 'Провокация / токсичное поведение'),
(12, 'Другое');

-- --------------------------------------------------------

--
-- Структура таблицы `roles`
--

CREATE TABLE `roles` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `description` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `roles`
--

INSERT INTO `roles` (`id`, `name`, `description`) VALUES
(1, 'Admin', 'Admin'),
(2, 'User', 'User'),
(3, 'Moderator', 'its Mario'),
(4, 'Super Admin', 'ohhhh yeees');

-- --------------------------------------------------------

--
-- Структура таблицы `setings`
--

CREATE TABLE `setings` (
  `id` int(11) NOT NULL,
  `version` varchar(10) DEFAULT NULL,
  `patch` varchar(45) DEFAULT NULL,
  `id_u` int(11) DEFAULT NULL,
  `date_update` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `setings`
--

INSERT INTO `setings` (`id`, `version`, `patch`, `id_u`, `date_update`) VALUES
(1, '4.2', '1777114030661.png', 2, '2026-05-09 20:53:13');

-- --------------------------------------------------------

--
-- Структура таблицы `topics`
--

CREATE TABLE `topics` (
  `id` int(11) NOT NULL,
  `title` varchar(200) NOT NULL,
  `category_id` int(11) NOT NULL,
  `author_id` int(11) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `is_closed` tinyint(1) DEFAULT 0,
  `description` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `topics`
--

INSERT INTO `topics` (`id`, `title`, `category_id`, `author_id`, `created_at`, `updated_at`, `is_closed`, `description`) VALUES
(4, 'Кого крутить в патче 2.4?', 10, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Обсуждение баннеров и меты'),
(5, 'Лучшие команды для Дан Хэна', 10, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Сборки и синергии'),
(6, 'Как пройти Виртуальную вселенную?', 10, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Гайд и советы'),
(7, 'Самые сильные персонажи сейчас', 10, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Tier list обсуждение'),
(8, 'Стоит ли качать 4★ героев?', 10, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Мнение игроков'),
(9, 'Фарм реликвий: где быстрее?', 10, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Опыт и маршруты'),
(10, 'Проблемы с эндгеймом', 10, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Что делать после сюжета'),
(11, 'Сюжет Пенаконии — разбор', 10, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Лор и теория'),
(12, 'Лучшие световые конусы', 10, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Сравнение оружия'),
(13, 'Ваш любимый персонаж HSR', 10, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Просто обсуждение'),
(14, 'Стоит ли крутить Арлекино?', 11, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Баннер и мета'),
(15, 'Лучшие команды для Фурины', 11, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Синергии и билды'),
(16, 'Фарм артефактов — боль или нет?', 11, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Обсуждение системы'),
(17, 'Как быстро качать аккаунт?', 11, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Советы новичкам'),
(18, 'Самые красивые регионы', 11, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Имерсив обсуждение'),
(19, 'Почему Скарамучча всё ещё имба?', 11, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Дискуссия'),
(20, 'Лучшие 5★ персонажи', 11, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Tier list'),
(21, 'Стоит ли донатить?', 11, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Опыт игроков'),
(22, 'Гайд по бездне 12 этаж', 11, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Стратегии'),
(23, 'Лор Тейвата — теория', 11, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Обсуждение истории'),
(24, 'Кто самый сильный агент?', 12, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Мета обсуждение'),
(25, 'Как проходить Hollow?', 12, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Гайды'),
(26, 'Лучшие команды в ZZZ', 12, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Синергии'),
(27, 'Фарм ресурсов быстро', 12, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Советы'),
(28, 'Стоит ли качать стартовых агентов?', 12, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Мнение'),
(29, 'Боёвка — сложная или нет?', 12, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Обсуждение механик'),
(30, 'Самые красивые персонажи', 12, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Оффтоп'),
(31, 'Сюжет ZZZ — мнение', 12, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Разбор истории'),
(32, 'Лучшее оружие', 12, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Сравнение'),
(33, 'Ваш любимый агент', 12, 2, '2026-05-01 19:19:06', '2026-05-01 19:19:06', 0, 'Просто чат'),
(34, 'Стоит ли качать этого персонажа?', 10, 29, '2026-04-03 19:29:57', '2026-05-01 19:29:57', 0, 'Опыт игроков'),
(35, 'Самые сильные персонажи', 11, 24, '2026-04-20 19:29:57', '2026-05-01 19:29:57', 0, 'Разбор механик и билдов'),
(36, 'Самые сильные персонажи', 12, 32, '2026-04-17 19:29:57', '2026-05-01 19:29:57', 0, 'Мета обсуждение'),
(37, 'Лор и теория сюжета', 11, 31, '2026-04-27 19:29:57', '2026-05-01 19:29:57', 0, 'Гайд и советы по игре'),
(38, 'Стоит ли качать этого персонажа?', 10, 16, '2026-04-23 19:29:57', '2026-05-01 19:29:57', 0, 'Гайд и советы по игре'),
(39, 'Фарм и ресурсы', 10, 29, '2026-04-04 19:29:57', '2026-05-01 19:29:57', 0, 'Гайд и советы по игре'),
(40, 'Лор и теория сюжета', 12, 27, '2026-04-24 19:29:57', '2026-05-01 19:29:57', 0, 'Опыт игроков'),
(41, 'Лучшие команды и сборки', 10, 28, '2026-04-12 19:29:57', '2026-05-01 19:29:57', 0, 'Мета обсуждение'),
(42, 'Стоит ли качать этого персонажа?', 11, 16, '2026-04-26 19:29:57', '2026-05-01 19:29:57', 0, 'Разбор механик и билдов'),
(43, 'Лор и теория сюжета', 10, 33, '2026-04-06 19:29:57', '2026-05-01 19:29:57', 0, 'Опыт игроков'),
(44, 'Обсуждение обновления', 10, 20, '2026-04-09 19:29:57', '2026-05-01 19:29:57', 0, 'Разбор механик и билдов'),
(45, 'Разбор эндгейм контента', 11, 32, '2026-04-14 19:29:57', '2026-05-01 19:29:57', 0, 'Обсуждение и мнение игроков'),
(46, 'Лор и теория сюжета', 10, 30, '2026-04-12 19:29:57', '2026-05-01 19:29:57', 0, 'Гайд и советы по игре'),
(47, 'Разбор эндгейм контента', 11, 22, '2026-04-21 19:29:57', '2026-05-01 19:29:57', 0, 'Опыт игроков'),
(48, 'Стоит ли качать этого персонажа?', 12, 12, '2026-04-10 19:29:57', '2026-05-01 19:29:57', 0, 'Обсуждение и мнение игроков'),
(49, 'Разбор эндгейм контента', 12, 29, '2026-04-17 19:29:57', '2026-05-01 19:29:57', 0, 'Мета обсуждение'),
(50, 'Гайд для новичков', 12, 12, '2026-04-19 19:29:57', '2026-05-01 19:29:57', 0, 'Опыт игроков'),
(51, 'Фарм и ресурсы', 10, 19, '2026-04-21 19:29:57', '2026-05-01 19:29:57', 0, 'Гайд и советы по игре'),
(52, 'Фарм и ресурсы', 10, 10, '2026-04-22 19:29:57', '2026-05-01 19:29:57', 0, 'Обсуждение и мнение игроков'),
(53, 'Стоит ли качать этого персонажа?', 10, 30, '2026-04-07 19:29:57', '2026-05-01 19:29:57', 0, 'Гайд и советы по игре'),
(54, 'Лучшие команды и сборки', 12, 25, '2026-04-16 19:29:57', '2026-05-01 19:29:57', 0, 'Разбор механик и билдов'),
(55, 'Обсуждение текущей меты', 12, 23, '2026-04-09 19:29:57', '2026-05-01 19:29:57', 0, 'Мета обсуждение'),
(56, 'Обсуждение текущей меты', 10, 33, '2026-04-29 19:29:57', '2026-05-01 19:29:57', 0, 'Опыт игроков'),
(57, 'Обсуждение обновления', 11, 10, '2026-04-17 19:29:57', '2026-05-01 19:29:57', 0, 'Гайд и советы по игре'),
(59, 'Обсуждение текущей меты', 10, 19, '2026-04-12 19:29:57', '2026-05-01 19:29:57', 0, 'Мета обсуждение'),
(60, 'Гайд для новичков', 10, 20, '2026-04-15 19:29:57', '2026-05-01 19:29:57', 0, 'Опыт игроков'),
(61, 'Гайд для новичков', 11, 33, '2026-04-10 19:29:57', '2026-05-01 19:29:57', 0, 'Свободная дискуссия'),
(62, 'Обсуждение текущей меты', 12, 22, '2026-04-06 19:29:57', '2026-05-01 19:29:57', 0, 'Мета обсуждение'),
(63, 'Самые сильные персонажи', 11, 30, '2026-04-12 19:29:57', '2026-05-01 19:29:57', 0, 'Свободная дискуссия');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL,
  `id_r` int(11) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `is_blocked` tinyint(1) DEFAULT 0,
  `uid` int(11) DEFAULT NULL,
  `about` text DEFAULT NULL,
  `avatarca` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password`, `id_r`, `created_at`, `updated_at`, `is_blocked`, `uid`, `about`, `avatarca`) VALUES
(2, 'Tunez', 'redinov14@gmail.com', '$2b$10$FfsRV1dodNItuuwQNfPBGeiJiyGCT/SIjkQP5Gjv5WZFLbuM6Ymk.', 1, '2026-04-09 08:52:10', '2026-05-11 09:32:18', 0, 666, '666', '1778463138212.png'),
(10, 'test', 'd.redinov@glory.tech', '$2b$10$IybmS2Hl1JbuyVJdLmY/ReEG5/s6POOf2p6C0Enrz0DJYtMo9MG0S', 2, '2026-04-21 23:18:32', '2026-05-11 09:30:09', 0, 666, 'sad', '1778463009036.jpg'),
(11, 'ShadowBlade', 'shadow1@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Люблю игры и мемы', '1777449166635.png'),
(12, 'NeonFox', 'neonfox@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Фанат аниме и RPG', '1777449166635.png'),
(13, 'KiraStar', 'kira.star@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Играю в HSR каждый день', '1777449166635.png'),
(14, 'VoidHunter', 'void.hunter@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Гриндер со стажем', '1777449166635.png'),
(15, 'LunaWave', 'luna.wave@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Обожаю Genshin', '1777449166635.png'),
(16, 'CyberSamurai', 'cyber.samurai@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Беру всё на критах', '1777449166635.png'),
(17, 'PixelMage', 'pixel.mage@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Люблю магов в играх', '1777449166635.png'),
(18, 'StormRider', 'storm.rider@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Скорость — это жизнь', '1777449166635.png'),
(19, 'FrostByte', 'frost.byte@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Холодный расчёт', '1777449166635.png'),
(20, 'NightPulse', 'night.pulse@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Играю ночью', '1777449166635.png'),
(21, 'EchoWolf', 'echo.wolf@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Одинокий игрок', '1777449166635.png'),
(22, 'StarNova', 'star.nova@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Люблю космос и HSR', '1777449166635.png'),
(23, 'BladeZero', 'blade.zero@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Файтинг и экшен', '1777449166635.png'),
(24, 'AquaSoul', 'aqua.soul@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Гидро фанат', '1777449166635.png'),
(25, 'IronClaw', 'iron.claw@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Танк по жизни', '1777449166635.png'),
(26, 'SkyBreaker', 'sky.breaker@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Разрушаю всё', '1777449166635.png'),
(27, 'NeoRift', 'neo.rift@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Люблю ZZZ', '1777449166635.png'),
(28, 'CrystalEye', 'crystal.eye@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Слежу за метой', '1777449166635.png'),
(29, 'DarkSaber', 'dark.saber@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Силы тьмы', '1777449166635.png'),
(30, 'WhiteFlame', 'white.flame@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Баланс и стратегия', '1777449166635.png'),
(31, 'ZeroGravity', 'zero.gravity@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Космический игрок', '1777449166635.png'),
(32, 'MoonLancer', 'moon.lancer@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Люблю копья', '1777449166635.png'),
(33, 'SolarEdge', 'solar.edge@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Солнечный билд', '1777449166635.png'),
(34, 'PhantomX', 'phantom.x@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Невидимый игрок', '1777449166635.png'),
(35, 'RogueSignal', 'rogue.signal@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Люблю хаос', '1777449166635.png'),
(36, 'IcePhoenix', 'ice.phoenix@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Возрождаюсь всегда', '1777449166635.png'),
(37, 'StormEcho', 'storm.echo@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Шум и скорость', '1777449166635.png'),
(38, 'NeonStrike', 'neon.strike@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Киберпанк вайб', '1777449166635.png'),
(39, 'ShadowCore', 'shadow.core@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Глубокая тьма', '1777449166635.png'),
(40, 'AlphaByte', 'alpha.byte@mail.com', 'pass', 2, '2026-05-01 19:25:02', '2026-05-11 09:35:30', 0, NULL, 'Первый среди кодеров', '1777449166635.png'),
(41, 'aaaa', 'aaaa@gmail.com', '$2b$10$NApswaeYYo456uwSDNb8Qe.koAXxbG.pDlP7GADKHDtRqH6IvRS9u', 2, '2026-05-03 08:00:53', '2026-05-11 09:35:30', 0, NULL, NULL, '1777449166635.png'),
(43, 'teste', 'd@glory.tech', '$2b$10$cjdHYQ.BWIPOG4apG8dM0uma4s4RxkllxS.2F6HswK1doBfyjgfg6', 2, '2026-05-03 08:02:33', '2026-05-11 09:35:30', 0, NULL, NULL, '1777449166635.png'),
(44, 'admin', 'asAS@gmail.com', '$2b$10$Qh6BxsjCYolu6vA0qZZ0X.Am1keiPuV1vPG.cBto3R8JeA6.LAbsK', 2, '2026-05-07 05:22:46', '2026-05-11 09:35:30', 0, NULL, NULL, '1777449166635.png'),
(47, 'adminnnnnnnnn', 'aaaabbbbbbcccccc@gmail.com', '$2b$10$rh.p/a7EKxiBhIB6Sphw/uQVvdx9IUey3/7iwxJSBIBC/Jplgs.gi', 2, '2026-05-07 06:46:56', '2026-05-11 09:35:30', 0, NULL, NULL, '1777449166635.png'),
(48, 'впар', 'dfgwacds@gmail.com', '$2b$10$enAX4CfOxvYhXfRNhsDIQ.mWMs9bkjwFgBydpv947tcK//SoWqEUu', 2, '2026-05-07 07:04:36', '2026-05-11 09:35:30', 0, NULL, NULL, '1777449166635.png'),
(49, 'test_user20', 'user20@test.com', '123456', 2, '2026-05-04 10:06:39', '2026-05-11 09:35:30', 0, NULL, 'Тестовый аккаунт', '1777449166635.png'),
(50, 'test_user21', 'user21@test.com', '123456', 2, '2026-05-05 10:06:39', '2026-05-11 09:35:30', 0, NULL, 'Тестовый аккаунт', '1777449166635.png'),
(51, 'test_user22', 'user22@test.com', '123456', 2, '2026-05-05 10:06:39', '2026-05-11 09:35:30', 0, NULL, 'Тестовый аккаунт', '1777449166635.png'),
(52, 'test_user23', 'user23@test.com', '123456', 2, '2026-05-06 10:06:39', '2026-05-11 09:35:30', 0, NULL, 'Тестовый аккаунт', '1777449166635.png'),
(53, 'test_user24', 'user24@test.com', '123456', 2, '2026-05-06 10:06:39', '2026-05-11 09:35:30', 0, NULL, 'Тестовый аккаунт', '1777449166635.png'),
(54, 'test_user25', 'user25@test.com', '123456', 2, '2026-05-07 10:06:39', '2026-05-11 09:35:30', 0, NULL, 'Тестовый аккаунт', '1777449166635.png'),
(55, 'test_user26', 'user26@test.com', '123456', 2, '2026-05-08 10:06:39', '2026-05-11 09:35:30', 0, NULL, 'Тестовый аккаунт', '1777449166635.png'),
(56, 'test_user27', 'user27@test.com', '123456', 2, '2026-05-08 10:06:39', '2026-05-11 09:35:30', 0, NULL, 'Тестовый аккаунт', '1777449166635.png'),
(57, 'test_user28', 'user28@test.com', '123456', 2, '2026-05-09 10:06:39', '2026-05-11 09:35:30', 0, NULL, 'Тестовый аккаунт', '1777449166635.png'),
(58, 'test_user29', 'user29@test.com', '123456', 2, '2026-05-10 10:06:39', '2026-05-11 09:35:30', 0, NULL, 'Тестовый аккаунт', '1777449166635.png');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `blocked_users`
--
ALTER TABLE `blocked_users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `blocked_by_id` (`blocked_by_id`);

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `parent_id` (`parent_id`);

--
-- Индексы таблицы `complaints`
--
ALTER TABLE `complaints`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `fk_complaints_reason` (`reason_id`),
  ADD KEY `fk_reports_topic` (`topic_id`);

--
-- Индексы таблицы `contacts`
--
ALTER TABLE `contacts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `moder_id` (`moder_id`);

--
-- Индексы таблицы `events`
--
ALTER TABLE `events`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id_u` (`id_u`);

--
-- Индексы таблицы `likes`
--
ALTER TABLE `likes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `post_id` (`post_id`,`user_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `topic_id` (`topic_id`),
  ADD KEY `author_id` (`author_id`),
  ADD KEY `parent_post_id` (`parent_post_id`);

--
-- Индексы таблицы `report_reasons`
--
ALTER TABLE `report_reasons`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `setings`
--
ALTER TABLE `setings`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id_u` (`id_u`);

--
-- Индексы таблицы `topics`
--
ALTER TABLE `topics`
  ADD PRIMARY KEY (`id`),
  ADD KEY `category_id` (`category_id`),
  ADD KEY `author_id` (`author_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`),
  ADD KEY `role_id` (`id_r`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `blocked_users`
--
ALTER TABLE `blocked_users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- AUTO_INCREMENT для таблицы `complaints`
--
ALTER TABLE `complaints`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT для таблицы `contacts`
--
ALTER TABLE `contacts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `events`
--
ALTER TABLE `events`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT для таблицы `likes`
--
ALTER TABLE `likes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT для таблицы `notifications`
--
ALTER TABLE `notifications`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `posts`
--
ALTER TABLE `posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=236;

--
-- AUTO_INCREMENT для таблицы `report_reasons`
--
ALTER TABLE `report_reasons`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблицы `roles`
--
ALTER TABLE `roles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `setings`
--
ALTER TABLE `setings`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `topics`
--
ALTER TABLE `topics`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=65;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `blocked_users`
--
ALTER TABLE `blocked_users`
  ADD CONSTRAINT `blocked_users_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `blocked_users_ibfk_2` FOREIGN KEY (`blocked_by_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `categories`
--
ALTER TABLE `categories`
  ADD CONSTRAINT `categories_ibfk_1` FOREIGN KEY (`parent_id`) REFERENCES `categories` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `complaints`
--
ALTER TABLE `complaints`
  ADD CONSTRAINT `complaints_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `complaints_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_complaints_reason` FOREIGN KEY (`reason_id`) REFERENCES `report_reasons` (`id`),
  ADD CONSTRAINT `fk_reports_topic` FOREIGN KEY (`topic_id`) REFERENCES `topics` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `contacts`
--
ALTER TABLE `contacts`
  ADD CONSTRAINT `contacts_ibfk_1` FOREIGN KEY (`moder_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `events`
--
ALTER TABLE `events`
  ADD CONSTRAINT `events_ibfk_1` FOREIGN KEY (`id_u`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `likes`
--
ALTER TABLE `likes`
  ADD CONSTRAINT `likes_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `likes_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `notifications`
--
ALTER TABLE `notifications`
  ADD CONSTRAINT `notifications_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `posts`
--
ALTER TABLE `posts`
  ADD CONSTRAINT `posts_ibfk_1` FOREIGN KEY (`topic_id`) REFERENCES `topics` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `posts_ibfk_2` FOREIGN KEY (`author_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `posts_ibfk_3` FOREIGN KEY (`parent_post_id`) REFERENCES `posts` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `setings`
--
ALTER TABLE `setings`
  ADD CONSTRAINT `setings_ibfk_1` FOREIGN KEY (`id_u`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `topics`
--
ALTER TABLE `topics`
  ADD CONSTRAINT `topics_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `topics_ibfk_2` FOREIGN KEY (`author_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `users_ibfk_1` FOREIGN KEY (`id_r`) REFERENCES `roles` (`id`) ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
